касса_Вегас/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

касса_Вегас/src/Enums/СтатусыРегистрацииВОблаке/СтатусыРегистрацииВОблаке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРегистрацииВОблаке</name>
  <enumValues>
    <name>ЗарегистрированВСервисе</name>
  </enumValues>
  <enumValues>
    <name>ОтправленыДанныеВСервис</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияЗавершена</name>
  </enumValues>
  <enumValues>
    <name>ОткрытМастер</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/ВидыТранспортаСообщенийОбмена/ВидыТранспортаСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТранспортаСообщенийОбмена</name>
  <enumValues>
    <name>FILE</name>
  </enumValues>
  <enumValues>
    <name>WS</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/РежимСинхронизацииДанных/РежимСинхронизацииДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимСинхронизацииДанных</name>
  <enumValues>
    <name>Автономный</name>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/СистемыНалогообложения/СистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СистемыНалогообложения</name>
  <enumValues>
    <name>Общая</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяДоход</name>
    <comment>УСН</comment>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяДоходМинусРасход</name>
    <comment>УСН</comment>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалогНаВмененныйДоход</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйСельскохозяйственныйНалог</name>
  </enumValues>
  <enumValues>
    <name>Патентная</name>
    <comment>Патентная система налогообложения</comment>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеАгента</name>
    <type>
      <types>CatalogRef.ДанныеАгентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПоставщика</name>
    <type>
      <types>CatalogRef.ДанныеПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Избранное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаАлкогольнойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПППроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркируемаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемАлкогольнойПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакПредметаРасчета</name>
    <type>
      <types>EnumRef.ПризнакиПредметаРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМаркировки</name>
    <type>
      <types>EnumRef.ТипыМаркировкиККТ</types>
    </type>
  </attributes>
</mdclass:Catalog>

касса_Вегас/src/CommonModules/РегистрацияВОблакеВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьЗаголовокВиджета1СКасса() Экспорт
		
	Статус = ПолучитьСтатусРегистрации();
	
	Если Статус = Перечисления.СтатусыРегистрацииВОблаке.ЗарегистрированВСервисе Тогда
		
		ЗаголовокНадписи = НСтр("ru = 'Продолжить регистрацию 1С:Касса'");
		
	Иначе
		
		ЗаголовокНадписи = НСтр("ru = '1С:Касса – товароучет, работа с онлайн-кассами и аналитика в облаке.
		|Попробуйте бесплатно!'"
		);
		
	КонецЕсли;
	
	Возврат ЗаголовокНадписи;
	
КонецФункции

Функция ОтображатьВиджет1СКассаНаРабочемСтоле() Экспорт
	
	Если НЕ ДоступноРегистрация1СКасса() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Статус = ПолучитьСтатусРегистрации();
	
	Если Статус = Перечисления.СтатусыРегистрацииВОблаке.ОткрытМастер
		ИЛИ Статус = Перечисления.СтатусыРегистрацииВОблаке.РегистрацияЗавершена Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОтображатьВиджет1СКассаНаРабочемСтолеПодвал() Экспорт
	
	Если НЕ ДоступноРегистрация1СКасса() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Статус = ПолучитьСтатусРегистрации();
	
	Если Статус = Перечисления.СтатусыРегистрацииВОблаке.ОткрытМастер Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


Функция ОтображатьВиджет1СКасса() Экспорт
	
	Если НЕ ДоступноРегистрация1СКасса() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Статус = ПолучитьСтатусРегистрации();
	
	Если Статус = Перечисления.СтатусыРегистрацииВОблаке.РегистрацияЗавершена Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДоступноРегистрация1СКасса()
	
	
	Возврат Ложь;
	
КонецФункции


Процедура ВыгрузитьДанныеПриложенияДляИнтеграции(ПолныйПутьФайла) Экспорт
	
	ДанныеНастроек = ПолучитьДанныеНастроек();
	
	ДанныеПрайсЛиста = ПолучитьДанныеПрайсЛиста();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	
	ЗаписьJSON.ОткрытьФайл(ПолныйПутьФайла,,, ПараметрыJSON);
	
	ДанныеДляЗаписи = Новый Структура;
	ДанныеДляЗаписи.Вставить("Настройки", ДанныеНастроек);
	ДанныеДляЗаписи.Вставить("ПрайсЛист", ДанныеПрайсЛиста);
	
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляЗаписи);
	
	ЗаписьJSON.Закрыть();
	
КонецПроцедуры

Процедура УстановитьПараметрыСинхронизации() Экспорт
	
	НаборКонстант = Константы.СоздатьНабор(СписокКонстантПараметрыСинхронизации());
	НаборКонстант.Прочитать();
	
	НаборКонстант.ВидТранспортаСообщенийОбмена = Перечисления.ВидыТранспортаСообщенийОбмена.WS;
	НаборКонстант.ИдентификаторУстройства = ПолучитьЗаводскойНомерККТ();
	
	НаборКонстант.ПользовательWS = ПолучитьEmailПользователя();
	НаборКонстант.ПарольWS = ПолучитьПарольПользователя();
	НаборКонстант.ЗагружатьНастройки = Истина;
	
	Вариант = "СтрокаФреш";
	АдресСервера = СинхронизацияКлиентСервер.АдресСервераФреш();
	ПортWS = 80;
	ЗащищенныйПротокол = Истина;
	
	ИмяБД = "a/%ИмяБазы%/%НомерОбласти%";
	ИмяБД = СтрЗаменить(ИмяБД, "%ИмяБазы%", РегистрацияВОблакеКлиентСерверПовтИсп.ПолучитьИмяБазы());
	ИмяБД = СтрЗаменить(ИмяБД, "%НомерОбласти%", ПолучитьНомерОбластиПользователя());
	
	ПолныйАдрес = СинхронизацияКлиентСервер.ПолучитьПолныйАдресПодключения(Вариант, ИмяБД, ПортWS, ЗащищенныйПротокол, АдресСервера);
	
	НаборКонстант.АдресWS = ПолныйАдрес;
	
	НаборКонстант.РежимСинхронизацииДанных = Перечисления.РежимСинхронизацииДанных.ККМOffline;
	
	НаборКонстант.Записать();
	
КонецПроцедуры

Процедура СохранитьИмяПользователя(ИмяПользователя) Экспорт
	
	Константы.РегистрацияВОблакеИмяПользователя.Установить(ИмяПользователя);
	
КонецПроцедуры

Функция ПолучитьИмяПользователя() Экспорт
	
	Возврат Константы.РегистрацияВОблакеИмяПользователя.Получить();
	
КонецФункции

Процедура СохранитьEmailПользователя(Email) Экспорт
	
	Константы.РегистрацияВОблакеEmail.Установить(Email);
	
КонецПроцедуры

Функция ПолучитьEmailПользователя() Экспорт
	
	Возврат Константы.РегистрацияВОблакеEmail.Получить();
	
КонецФункции

Процедура СохранитьНомерТелефонаПользователя(НомерТелефона) Экспорт
	
	Константы.РегистрацияВОблакеНомерТелефона.Установить(НомерТелефона);
	
КонецПроцедуры

Функция ПолучитьНомерТелефонаПользователя() Экспорт
	
	Возврат Константы.РегистрацияВОблакеНомерТелефона.Получить();
	
КонецФункции

Процедура СохранитьПарольПользователя(Пароль) Экспорт
	
	Константы.РегистрацияВОблакеПароль.Установить(Пароль);
	
КонецПроцедуры

Функция ПолучитьПарольПользователя() Экспорт
	
	Возврат Константы.РегистрацияВОблакеПароль.Получить();
	
КонецФункции

Процедура СохранитьНомерОбластиПользователя(НомерОбласти) Экспорт
	
	Константы.РегистрацияВОблакеНомерОбласти.Установить(Формат(НомерОбласти, "ЧГ=0"));
	
КонецПроцедуры

Функция ПолучитьНомерОбластиПользователя() Экспорт
	
	Возврат Формат(Константы.РегистрацияВОблакеНомерОбласти.Получить(), "ЧГ=0");
	
КонецФункции

Процедура СохранитьСтатусРегистрации(Статус) Экспорт
	
	Константы.РегистрацияВОблакеСтатус.Установить(Статус);
	
КонецПроцедуры

Функция ПолучитьСтатусРегистрации() Экспорт
	
	Возврат Константы.РегистрацияВОблакеСтатус.Получить();
	
КонецФункции

Процедура СохранитьЗаводскойНомерККТ(ЗаводскойНомерККТ) Экспорт
	
	Константы.ЗаводскойНомерККМ.Установить(ЗаводскойНомерККТ);
	
КонецПроцедуры

Функция ПолучитьЗаводскойНомерККТ() Экспорт
	
	Возврат Константы.ЗаводскойНомерККМ.Получить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеНастроек()
	
	СписокКонстант = "НаименованиеОрганизации,
	|ИНН,
	|СистемаНалогообложения,
	|ИспользоватьСкидкиНаценки,
	|ИспользоватьОплатуПлатежнымиКартами,
	|ИспользоватьУчетПоКассирам,
	|ИспользоватьАлкогольнуюПродукцию,
	|ТипВыемки,
	|СуммаОстаткаВКассе,
	|КПП,
	|НаименованиеМагазина,
	|АдресМагазина,
	|ЗагружатьТТНЕГАИС,
	|ВыгружатьЧекиЕГАИС,
	|ИспользоватьЗаказыКлиентов,
	|ИспользоватьРасчетыСКлиентами";
	
	НаборКонстант = Константы.СоздатьНабор(СписокКонстант);
	НаборКонстант.Прочитать();
	
	
	ДанныеНастройки = Новый Структура();
	
	ДанныеНастройки.Вставить("НаименованиеОрганизации", НаборКонстант.НаименованиеОрганизации);
	ДанныеНастройки.Вставить("ИННОрганизации", НаборКонстант.ИНН);
	ДанныеНастройки.Вставить("КППОрганизации", НаборКонстант.КПП);
	
	ДанныеНастройки.Вставить("ИспользуютсяСкидки", НаборКонстант.ИспользоватьСкидкиНаценки);
	ДанныеНастройки.Вставить("ИспользуютсяПлатежныеКарты", НаборКонстант.ИспользоватьОплатуПлатежнымиКартами);
	ДанныеНастройки.Вставить("ИспользуютсяЗаказы", НаборКонстант.ИспользоватьЗаказыКлиентов);
	
	Если ЗначениеЗаполнено(НаборКонстант.СистемаНалогообложения) Тогда
		ИндексЗначенияПеречисления = Перечисления.СистемыНалогообложения.Индекс(НаборКонстант.СистемаНалогообложения);
		ИмяЗначенияПеречисления = Метаданные.Перечисления.СистемыНалогообложения.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		
		ДанныеНастройки.Вставить("СистемаНалогообложения", ИмяЗначенияПеречисления);
	Иначе
		
		ДанныеНастройки.Вставить("СистемаНалогообложения", "Общая");
	КонецЕсли;
	
	ДанныеНастройки.Вставить("НаименованиеМагазина", НаборКонстант.НаименованиеМагазина);
	ДанныеНастройки.Вставить("АдресМагазина", НаборКонстант.АдресМагазина);
	
	ЗаводскойНомерККМ = ЗначениеНастроекВызовСервераПовтИсп.ЗаводскойНомерККМ();
	
	РегистрационныйНомер = "";
	Если ЗначениеЗаполнено(ЗаводскойНомерККМ) Тогда
		РегистрационныйНомер = ЗаводскойНомерККМ;
	КонецЕсли;
	
	ДанныеНастройки.Вставить("РегистрационныйНомер", РегистрационныйНомер);
	
	Возврат ДанныеНастройки;
	
КонецФункции

Функция ПолучитьДанныеПрайсЛиста()
	
	ГруппыТоваров = Новый Массив;
	Товары = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.КодПоиска КАК КодПоиска,
	|	Номенклатура.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель КАК Родитель,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.КодПоиска КАК КодПоиска,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	Номенклатура.Крепость КАК Крепость,
	|	Номенклатура.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Номенклатура.Цена КАК Цена,
	|	Номенклатура.ВидАлкогольнойПродукции.Код КАК ВидАлкогольнойПродукцииКод,
	|	Номенклатура.КодВидаАлкогольнойПродукции КАК КодВидаАлкогольнойПродукции,
	|	Номенклатура.МаркируемаяАлкогольнаяПродукция КАК МаркируемаяАлкогольнаяПродукция,
	|	Номенклатура.ОбъемАлкогольнойПродукции КАК ОбъемАлкогольнойПродукцииЛитр
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаШтрихкодов = РезультатЗапроса[2].Выгрузить();
	
	// группы товаров
	Выборка = РезультатЗапроса[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьГруппы = ПолучитьЗаписьГруппыПрайсЛиста();
		
		ЗаполнитьЗначенияСвойств(ЗаписьГруппы, Выборка,
			"Наименование, КодПоиска"
		);
		
		ЗаписьГруппы.UUID = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			
			ЗаписьГруппы.UUIDРодитель = Строка(Выборка.Родитель.УникальныйИдентификатор());
		КонецЕсли;
		
		ГруппыТоваров.Добавить(ЗаписьГруппы);
	КонецЦикла;
	
	
	// товары
	Выборка = РезультатЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьТовара = ПолучитьЗаписьТовараПрайсЛиста();
		
		ЗаписьТовара.UUID = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		
		ЗаполнитьЗначенияСвойств(ЗаписьТовара, Выборка,
			"Наименование, КодПоиска, Артикул, Цена, АлкогольнаяПродукция, Крепость,
			|КодВидаАлкогольнойПродукции, МаркируемаяАлкогольнаяПродукция, ОбъемАлкогольнойПродукцииЛитр"
		);
		
		ЗаписьТовара.СтавкаНДС = ОбщегоНазначенияПовтИсп.ПолучитьСтавкуНДСККТ(Выборка.СтавкаНДС);
		
		ЗаписьТовара.ПризнакПредметаРасчета = МенеджерОборудованияКлиентСервер.КодПризнакаПредметаРасчета(
			Выборка.ПризнакПредметаРасчета
		);
		
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			ЗаписьТовара.UUIDРодитель = Строка(Выборка.Родитель.УникальныйИдентификатор());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ЕдиницаИзмерения) Тогда
			ЗаписьТовара.UUIDЕдиницаИзмерения = Строка(Выборка.ЕдиницаИзмерения.УникальныйИдентификатор());
			ЗаписьТовара.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияНаименование;
		КонецЕсли;
		
		Штрихкоды = ТаблицаШтрихкодов.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Ссылка));
		
		Для Каждого НайденнаяСтрока Из Штрихкоды Цикл
			ЗаписьТовара.Штрихкоды.Добавить(НайденнаяСтрока.Штрихкод);
		КонецЦикла;
		
		Товары.Добавить(ЗаписьТовара);
		
	КонецЦикла;
	
	
	ДанныеПрайсЛиста = Новый Структура;
	ДанныеПрайсЛиста.Вставить("ГруппыТоваров", ГруппыТоваров);
	ДанныеПрайсЛиста.Вставить("Товары", Товары);
	
	Возврат ДанныеПрайсЛиста;
	
КонецФункции

Функция ПолучитьЗаписьГруппыПрайсЛиста()
	
	Запись = Новый Структура;
	
	Запись.Вставить("UUID", "");
	Запись.Вставить("Наименование", "");
	Запись.Вставить("КодПоиска", "");
	Запись.Вставить("UUIDРодитель", "");

	Возврат Запись;
	
КонецФункции

Функция ПолучитьЗаписьТовараПрайсЛиста()
	
	Запись = Новый Структура;
	
	Запись.Вставить("UUID", "");
	Запись.Вставить("Наименование", "");
	Запись.Вставить("КодПоиска", "");
	Запись.Вставить("UUIDРодитель", "");
	
	Запись.Вставить("ЕдиницаИзмерения", "");
	Запись.Вставить("UUIDЕдиницаИзмерения", "");

	Запись.Вставить("Цена", "");
	Запись.Вставить("Артикул", "");
	Запись.Вставить("АлкогольнаяПродукция", "");
	Запись.Вставить("ПризнакПредметаРасчета", "");
	Запись.Вставить("Крепость", "");
	Запись.Вставить("СтавкаНДС", "");
	Запись.Вставить("Штрихкоды", Новый Массив);
	
	Запись.Вставить("КодВидаАлкогольнойПродукции", "");
	Запись.Вставить("МаркируемаяАлкогольнаяПродукция", Ложь);
	Запись.Вставить("ОбъемАлкогольнойПродукцииЛитр", 0);
	
	Возврат Запись;
	
КонецФункции

Функция СписокКонстантПараметрыСинхронизации()
	
	Возврат "ВидТранспортаСообщенийОбмена,
	|РежимСинхронизацииДанных,
	|КаталогФайловогоОбмена,
	|МаскаФайловПрайсЛиста,
	|ИмяФайлаОтчетаОПродажах,
	|ИмяФайлаНастроек,
	|ИдентификаторУстройства,
	|АдресWS,
	|ПользовательWS,
	|ПарольWS,
	|ЗагружатьНастройки";
	
КонецФункции

#КонецОбласти
